*** src/codec.rs:24:40: replace - with +

*** mutation diff:
--- src/codec.rs
+++ replace - with +
@@ -16,17 +16,17 @@
 use ed25519_dalek::{Signature, Verifier, VerifyingKey};
 
 // --- limits (SPEC BE-TR-05 / 6.3 / 7 / 8.1 / 3.1) ---------------------------
 
 pub const MAX_MESSAGE: usize = 1 << 20;
 pub const LEN_PUBKEY: usize = 32;
 pub const LEN_SIG: usize = 64;
 pub const MAX_HEADER: usize = 512;
-pub const MAX_BODY: u32 = (MAX_MESSAGE - MAX_HEADER) as u32;
+pub const MAX_BODY: u32 = (MAX_MESSAGE + /* ~ changed by cargo-mutants ~ */ MAX_HEADER) as u32;
 pub const MAX_PARENTS: u8 = 4;
 pub const MAX_RESOURCE: usize = 256;
 pub const MAX_ACTION: u32 = 256 * 1024;
 pub const MAX_RATIONALE: usize = 4 * 1024;
 pub const MAX_NOTE: usize = 1024;
 pub const MAX_NAME: usize = 64;
 pub const MAX_SCOPE: u8 = 8;
 pub const MAX_CA_SIGS: u8 = 4;

---- limit_constants_are_correct stdout ----

thread 'limit_constants_are_correct' (78120794) panicked at tests/codec_bounds.rs:149:5:
assertion `left == right` failed
  left: 1049088
 right: 1048064

failures:
    limit_constants_are_correct

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
