*** src/codec.rs:27:33: replace * with /

*** mutation diff:
--- src/codec.rs
+++ replace * with /
@@ -19,17 +19,17 @@
 
 pub const MAX_MESSAGE: usize = 1 << 20;
 pub const LEN_PUBKEY: usize = 32;
 pub const LEN_SIG: usize = 64;
 pub const MAX_HEADER: usize = 512;
 pub const MAX_BODY: u32 = (MAX_MESSAGE - MAX_HEADER) as u32;
 pub const MAX_PARENTS: u8 = 4;
 pub const MAX_RESOURCE: usize = 256;
-pub const MAX_ACTION: u32 = 256 * 1024;
+pub const MAX_ACTION: u32 = 256 / /* ~ changed by cargo-mutants ~ */ 1024;
 pub const MAX_RATIONALE: usize = 4 * 1024;
 pub const MAX_NOTE: usize = 1024;
 pub const MAX_NAME: usize = 64;
 pub const MAX_SCOPE: u8 = 8;
 pub const MAX_CA_SIGS: u8 = 4;
 
 pub const LEN_CHANNEL_ID: usize = 32;
 pub const LEN_PARENT: usize = 32;

---- limit_constants_are_correct stdout ----

thread 'limit_constants_are_correct' (78049397) panicked at tests/codec_bounds.rs:151:5:
assertion `left == right` failed
  left: 0
 right: 262144

failures:
    limit_constants_are_correct

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
