*** src/codec.rs:89:25: replace <= with > in Cursor<'a>::need

*** mutation diff:
--- src/codec.rs
+++ replace <= with > in Cursor<'a>::need
@@ -81,17 +81,17 @@
 }
 
 impl<'a> Cursor<'a> {
     fn new(buf: &'a [u8]) -> Self {
         Cursor { buf, pos: 0 }
     }
     /// The ONE truncation exit point (BE-WIRE-02).
     fn need(&self, n: usize) -> Result<(), ParseError> {
-        if self.pos + n <= self.buf.len() {
+        if self.pos + n > /* ~ changed by cargo-mutants ~ */ self.buf.len() {
             Ok(())
         } else {
             Err(ParseError::Truncated)
         }
     }
     fn u8r(&mut self) -> Result<u8, ParseError> {
         self.need(1)?;
         let v = self.buf[self.pos];

---- cert_ca_keys_equal_fails stdout ----

thread 'cert_ca_keys_equal_fails' (78090163) panicked at tests/codec_bounds.rs:123:5:
equal CA keys must fail, got Err(Truncated)

---- cert_ca_keys_descending_fails stdout ----

thread 'cert_ca_keys_descending_fails' (78090162) panicked at tests/codec_bounds.rs:143:5:
descending CA keys must fail, got Err(Truncated)

---- cert_ca_keys_ascending_must_succeed stdout ----

thread 'cert_ca_keys_ascending_must_succeed' (78090161) panicked at tests/codec_bounds.rs:220:5:
ascending CA keys must succeed, got Err(Truncated)

failures:
    cert_ca_keys_ascending_must_succeed
    cert_ca_keys_descending_fails
    cert_ca_keys_equal_fails
    cert_ca_sig_count_boundary
    cert_name_at_max_name_boundary
    cert_scope_count_boundary
    cursor_u32be_sequential_reads_independent
    envelope_body_at_max_body_boundary
    envelope_body_len_oversized
    envelope_parent_count_boundary
    intent_action_at_max_action_boundary

test result: FAILED. 1 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
