*** src/codec.rs:89:27: replace - with + in Cursor<'a>::need

*** mutation diff:
--- src/codec.rs
+++ replace - with + in Cursor<'a>::need
@@ -81,17 +81,17 @@
 }
 
 impl<'a> Cursor<'a> {
     fn new(buf: &'a [u8]) -> Self {
         Cursor { buf, pos: 0 }
     }
     /// The ONE truncation exit point (BE-WIRE-02).
     fn need(&self, n: usize) -> Result<(), ParseError> {
-        if self.buf.len() - self.pos >= n {
+        if self.buf.len() + /* ~ changed by cargo-mutants ~ */ self.pos >= n {
             Ok(())
         } else {
             Err(ParseError::Truncated)
         }
     }
     fn u8r(&mut self) -> Result<u8, ParseError> {
         self.need(1)?;
         let v = self.buf[self.pos];

---- every_negative_rejects stdout ----

thread 'every_negative_rejects' (78060723) panicked at src/codec.rs:127:26:
range end index 280 out of range for slice of length 279

failures:
    every_negative_rejects

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Success
