*** src/codec.rs:89:38: replace >= with < in Cursor<'a>::need

*** mutation diff:
--- src/codec.rs
+++ replace >= with < in Cursor<'a>::need
@@ -81,17 +81,17 @@
 }
 
 impl<'a> Cursor<'a> {
     fn new(buf: &'a [u8]) -> Self {
         Cursor { buf, pos: 0 }
     }
     /// The ONE truncation exit point (BE-WIRE-02).
     fn need(&self, n: usize) -> Result<(), ParseError> {
-        if self.buf.len() - self.pos >= n {
+        if self.buf.len() - self.pos < /* ~ changed by cargo-mutants ~ */ n {
             Ok(())
         } else {
             Err(ParseError::Truncated)
         }
     }
     fn u8r(&mut self) -> Result<u8, ParseError> {
         self.need(1)?;
         let v = self.buf[self.pos];

---- envelope_body_len_oversized stdout ----

thread 'envelope_body_len_oversized' (78056660) panicked at tests/codec_bounds.rs:38:5:
body_len MAX_BODY+1 must fail, got Err(Truncated)

---- cert_scope_count_boundary stdout ----

thread 'cert_scope_count_boundary' (78056657) panicked at tests/codec_bounds.rs:83:5:
scope_count == MAX_SCOPE must succeed, got Err(Truncated)

---- cert_ca_keys_descending_fails stdout ----

thread 'cert_ca_keys_descending_fails' (78056653) panicked at tests/codec_bounds.rs:143:5:
descending CA keys must fail, got Err(Truncated)

failures:
    cert_ca_keys_ascending_must_succeed
    cert_ca_keys_descending_fails
    cert_ca_keys_equal_fails
    cert_ca_sig_count_boundary
    cert_name_at_max_name_boundary
    cert_scope_count_boundary
    cursor_u32be_sequential_reads_independent
    envelope_body_at_max_body_boundary
    envelope_body_len_oversized
    envelope_parent_count_boundary
    intent_action_at_max_action_boundary

test result: FAILED. 1 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
