*** src/codec.rs:96:9: replace Cursor<'a>::u8r -> Result<u8, ParseError> with Ok(1)

*** mutation diff:
--- src/codec.rs
+++ replace Cursor<'a>::u8r -> Result<u8, ParseError> with Ok(1)
@@ -88,20 +88,17 @@
     fn need(&self, n: usize) -> Result<(), ParseError> {
         if self.pos + n <= self.buf.len() {
             Ok(())
         } else {
             Err(ParseError::Truncated)
         }
     }
     fn u8r(&mut self) -> Result<u8, ParseError> {
-        self.need(1)?;
-        let v = self.buf[self.pos];
-        self.pos += 1;
-        Ok(v)
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
     fn u16be(&mut self) -> Result<u16, ParseError> {
         self.need(2)?;
         let v = u16::from_be_bytes([self.buf[self.pos], self.buf[self.pos + 1]]);
         self.pos += 2;
         Ok(v)
     }
     fn u32be(&mut self) -> Result<u32, ParseError> {

---- cert_ca_keys_ascending_must_succeed stdout ----

thread 'cert_ca_keys_ascending_must_succeed' (78148938) panicked at tests/codec_bounds.rs:220:5:
ascending CA keys must succeed, got Err(Oversize)

---- cert_ca_keys_equal_fails stdout ----

thread 'cert_ca_keys_equal_fails' (78148940) panicked at tests/codec_bounds.rs:123:5:
equal CA keys must fail, got Err(Oversize)

---- cert_scope_count_boundary stdout ----

thread 'cert_scope_count_boundary' (78148943) panicked at tests/codec_bounds.rs:83:5:
scope_count == MAX_SCOPE must succeed, got Err(Oversize)

failures:
    cert_ca_keys_ascending_must_succeed
    cert_ca_keys_descending_fails
    cert_ca_keys_equal_fails
    cert_ca_sig_count_boundary
    cert_name_at_max_name_boundary
    cert_scope_count_boundary
    cursor_u32be_sequential_reads_independent
    envelope_body_at_max_body_boundary
    envelope_body_len_oversized
    envelope_parent_count_boundary

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
