*** src/codec.rs:98:18: replace += with -= in Cursor<'a>::u8r

*** mutation diff:
--- src/codec.rs
+++ replace += with -= in Cursor<'a>::u8r
@@ -90,17 +90,17 @@
             Ok(())
         } else {
             Err(ParseError::Truncated)
         }
     }
     fn u8r(&mut self) -> Result<u8, ParseError> {
         self.need(1)?;
         let v = self.buf[self.pos];
-        self.pos += 1;
+        self.pos -= /* ~ changed by cargo-mutants ~ */ 1;
         Ok(v)
     }
     fn u16be(&mut self) -> Result<u16, ParseError> {
         self.need(2)?;
         let v = u16::from_be_bytes([self.buf[self.pos], self.buf[self.pos + 1]]);
         self.pos += 2;
         Ok(v)
     }

---- cert_name_at_max_name_boundary stdout ----

thread 'cert_name_at_max_name_boundary' (78102447) panicked at src/codec.rs:98:9:
attempt to subtract with overflow

---- envelope_parent_count_boundary stdout ----

thread 'envelope_parent_count_boundary' (78102452) panicked at src/codec.rs:98:9:
attempt to subtract with overflow

---- cert_ca_keys_ascending_must_succeed stdout ----

thread 'cert_ca_keys_ascending_must_succeed' (78102443) panicked at src/codec.rs:98:9:
attempt to subtract with overflow

failures:
    cert_ca_keys_ascending_must_succeed
    cert_ca_keys_descending_fails
    cert_ca_keys_equal_fails
    cert_ca_sig_count_boundary
    cert_name_at_max_name_boundary
    cert_scope_count_boundary
    cursor_u32be_sequential_reads_independent
    envelope_body_at_max_body_boundary
    envelope_body_len_oversized
    envelope_parent_count_boundary

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
