*** src/codec.rs:98:18: replace += with *= in Cursor<'a>::u8r

*** mutation diff:
--- src/codec.rs
+++ replace += with *= in Cursor<'a>::u8r
@@ -90,17 +90,17 @@
             Ok(())
         } else {
             Err(ParseError::Truncated)
         }
     }
     fn u8r(&mut self) -> Result<u8, ParseError> {
         self.need(1)?;
         let v = self.buf[self.pos];
-        self.pos += 1;
+        self.pos *= /* ~ changed by cargo-mutants ~ */ 1;
         Ok(v)
     }
     fn u16be(&mut self) -> Result<u16, ParseError> {
         self.need(2)?;
         let v = u16::from_be_bytes([self.buf[self.pos], self.buf[self.pos + 1]]);
         self.pos += 2;
         Ok(v)
     }


