*** src/main.rs:36:5: replace parse_bind -> Option<SocketAddr> with None

*** mutation diff:
--- src/main.rs
+++ replace parse_bind -> Option<SocketAddr> with None
@@ -28,17 +28,17 @@
 }
 
 fn fatal(msg: &str) -> ! {
     eprintln!("bolina: fatal: {}", msg);
     std::process::exit(1);
 }
 
 fn parse_bind(spec: &str) -> Option<SocketAddr> {
-    spec.parse().ok()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn main() {
     // 1. Env config
     if env::var("BOLINA_TEST_CA").is_ok() {
         fatal("BOLINA_TEST_CA is dev-only; test pilots mint their CA in-process");
     }
     let bind_spec = env_or("BOLINA_BIND", DEFAULT_BIND);

*** result: Success
